tymmothy/LPC11xx_Device_Lib_v1.2/inc/lpc11xx/syscon.h
/** ***************************************************************************
 * @file     syscon.h
 * @brief    System Control Block Interface Header for LPC11xx Microcontrollers
 * @version  V1.0
 * @author   Tymm Twillman
 * @date     1. June 2010
 * @license  Simplified BSD License
 ******************************************************************************
 * Copyright (c) 2012, Timothy Twillman
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 *  modification, are permitted provided that the following conditions are met:
 *
 *    1. Redistributions of source code must retain the above copyright notice,
 *        this list of conditions and the following disclaimer.
 *
 *    2. Redistributions in binary form must reproduce the above copyright
 *       notice, this list of conditions and the following disclaimer in the
 *       documentation and/or other materials provided with the distribution.
 *
 * THIS SOFTWARE IS PROVIDED ''AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES,
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY
 * AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL
 * TIMOTHY TWILLMAN OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
 * NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
 * DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
 * THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
 * THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 * The views and conclusions contained in the software and documentation are
 * those of the authors and should not be interpreted as representing official
 * policies, either expressed or implied, of Timothy Twillman.
 *****************************************************************************
 * This file defines types and functions for using the LPC11xx System Control
 * block:
 *  - Memory Remapping
 *  - Peripheral Resetting
 *  - System, WDT, Peripheral, IRC, PLL, AHB Clocks
 *  - Brownout Detector
 *  - System Start Logic
 *  - System Power Down / Wake Settings
 *  - LPC11xx Device ID's
 *****************************************************************************/

#ifndef LPC_SYSCON_H_
#define LPC_SYSCON_H_

#ifdef __cplusplus
extern "C" {
#endif


/* Includes -----------------------------------------------------------------*/

#include <stdint.h>
#include "lpc11xx.h"
#include "lpclib_assert.h"


/**
  * @defgroup SYSCON_Access_Interface SYSCON (System Control Block) Access-level Interface
  * @ingroup  LPC_Peripheral_Access_Layer
  * @{
  */

/* Types & Type-Related Definitions -----------------------------------------*/

/** @defgroup SYSCON_Access_Types SYSCON Access-level Interface Types & Definitions
  * @{
  */

/** @defgroup SYSCON_RemapMem SYSCON first meory page / ISR vector remapping settings.
  * @{
  */

/*! First page / ISR vector memory remapping options */
typedef enum {
    SYSCON_RemapMem_Bootloader = 0x00,                     /*!< ISR vector mapped from bootldr.  */
    SYSCON_RemapMem_RAM,                                   /*!< ISR vector mapped from RAM       */
    SYSCON_RemapMem_FLASH,                                 /*!< ISR vector mapped from Flash     */
} SYSCON_RemapMem_Type;

/*! Macro to test whether parameter is a valid memory remapping setting */
#define SYSCON_IS_REMAP_MEM(RemapMem) (((RemapMem) == SYSCON_RemapMem_Bootloader)  \
                                    || ((RemapMem) == SYSCON_RemapMem_RAM)         \
                                    || ((RemapMem) == SYSCON_RemapMem_FLASH))

/** @} */

/** @defgroup SYSCON_PeripheralResets SYSCON Peripheral Reset Control Bits (active low)
  * @{
  */

#define SYSCON_PeripheralReset_SSP0       (1 << 0)         /*!< Reset control for SSP0 device    */
#define SYSCON_PeripheralReset_I2C0       (1 << 1)         /*!< Reset control for I2C0 device    */
#define SYSCON_PeripheralReset_SSP1       (1 << 2)         /*!< Reset control for SSP1 device    */

#if defined(LPC11CXX)  /*! CAN parts only */
# define SYSCON_PeripheralReset_CAN0      (1 << 3)         /*!< Reset control for CAN0 device    */
#endif

/** @} */

/** @defgroup SYSCON_SysOscFreqRanges SYSCON System Oscillator Frequency Range
  * @{
  */

/*! System oscillator frequency range settings for external crystals */
typedef enum {
    SYSCON_SysOscFreqRange_1_20 = 0,                       /*!< Setting for  1-20 MHz ext. xtal  */
    SYSCON_SysOscFreqRange_15_25                           /*!< Setting for 15-25 MHz ext. xtal  */
} SYSCON_SysOscFreqRange_Type;

/*! Macro to test whether parameter is a valid system oscillator frequency range value */
#define SYSCON_IS_SYSOSC_FREQ_RANGE(Range) (((Range) == SYSCON_SysOscFreqRange_1_20) \
                                         || ((Range) == SYSCON_SysOscFreqRange_15_25))

/** @} */

/** @defgroup SYSCON_WDTOscFreqs SYSCON Watchdog Timer Oscillator Frequency Settings
  * @{
  */

/*! Watchdog frequency values */
typedef enum {
    SYSCON_WDTOscFreq_0_5_Mhz = 0x01,                      /*!< Run WDT oscillator @ 0.5 Mhz     */
    SYSCON_WDTOscFreq_0_8_Mhz = 0x02,                      /*!< Run WDT oscillator @ 0.8 Mhz     */
    SYSCON_WDTOscFreq_1_1_Mhz = 0x03,                      /*!< Run WDT oscillator @ 1.1 Mhz     */
    SYSCON_WDTOscFreq_1_4_Mhz = 0x04,                      /*!< Run WDT oscillator @ 1.4 Mhz     */
    SYSCON_WDTOscFreq_1_6_Mhz = 0x05,                      /*!< Run WDT oscillator @ 1.6 Mhz     */
    SYSCON_WDTOscFreq_1_8_Mhz = 0x06,                      /*!< Run WDT oscillator @ 1.8 Mhz     */
    SYSCON_WDTOscFreq_2_0_Mhz = 0x07,                      /*!< Run WDT oscillator @ 2.0 Mhz     */
    SYSCON_WDTOscFreq_2_2_Mhz = 0x08,                      /*!< Run WDT oscillator @ 2.2 Mhz     */
    SYSCON_WDTOscFreq_2_4_Mhz = 0x09,                      /*!< Run WDT oscillator @ 2.4 Mhz     */
    SYSCON_WDTOscFreq_2_6_Mhz = 0x0a,                      /*!< Run WDT oscillator @ 2.6 Mhz     */
    SYSCON_WDTOscFreq_2_7_Mhz = 0x0b,                      /*!< Run WDT oscillator @ 2.7 Mhz     */
    SYSCON_WDTOscFreq_2_9_Mhz = 0x0c,                      /*!< Run WDT oscillator @ 2.9 Mhz     */
    SYSCON_WDTOscFreq_3_1_Mhz = 0x0d,                      /*!< Run WDT oscillator @ 3.1 Mhz     */
    SYSCON_WDTOscFreq_3_2_Mhz = 0x0e,                      /*!< Run WDT oscillator @ 3.2 Mhz     */
    SYSCON_WDTOscFreq_3_4_Mhz = 0x0f                       /*!< Run WDT oscillator @ 3.4 Mhz     */
} SYSCON_WDTOscFreq_Type;

