tymmothy/LPC11xx_Device_Lib_v1.2/inc/lpc11xx/syscon.h
/*! Macro to test whether parameter is a valid watchdog frequency value */
#define SYSCON_IS_WDT_OSC_FREQ(Freq) (((Freq) == SYSCON_WDTOscFreq_0_5_Mhz) \
                                   || ((Freq) == SYSCON_WDTOscFreq_0_8_Mhz) \
                                   || ((Freq) == SYSCON_WDTOscFreq_1_1_Mhz) \
                                   || ((Freq) == SYSCON_WDTOscFreq_1_4_Mhz) \
                                   || ((Freq) == SYSCON_WDTOscFreq_1_6_Mhz) \
                                   || ((Freq) == SYSCON_WDTOscFreq_1_8_Mhz) \
                                   || ((Freq) == SYSCON_WDTOscFreq_2_0_Mhz) \
                                   || ((Freq) == SYSCON_WDTOscFreq_2_2_Mhz) \
                                   || ((Freq) == SYSCON_WDTOscFreq_2_4_Mhz) \
                                   || ((Freq) == SYSCON_WDTOscFreq_2_6_Mhz) \
                                   || ((Freq) == SYSCON_WDTOscFreq_2_7_Mhz) \
                                   || ((Freq) == SYSCON_WDTOscFreq_2_9_Mhz) \
                                   || ((Freq) == SYSCON_WDTOscFreq_3_1_Mhz) \
                                   || ((Freq) == SYSCON_WDTOscFreq_3_2_Mhz) \
                                   || ((Freq) == SYSCON_WDTOscFreq_3_4_Mhz))

/** @} */

/** @defgroup SYSCON_ResetSources SYSCON Sytem Reset Source Flags
  * @{
  */

#define SYSCON_ResetSource_POR            (1 << 0)         /*!< System reset from power on reset */
#define SYSCON_ResetSource_EXT            (1 << 1)         /*!< System reset from external reset */
#define SYSCON_ResetSource_WDT            (1 << 2)         /*!< System reset from watchdog timer */
#define SYSCON_ResetSource_BOD            (1 << 3)         /*!< System reset from brownout       */
#define SYSCON_ResetSource_SYSRST         (1 << 4)         /*!< System reset from NVIC reset     */

/** @} */

/** @defgroup SYSCON_AHBClockLines AHB Clock Control Lines
  * @{
  */

#define SYSCON_AHBClockLine_SYS         (1UL << 0)         /*!< AHB clock line to system block   */
#define SYSCON_AHBClockLine_ROM         (1UL << 1)         /*!< AHB clock line to ROM            */
#define SYSCON_AHBClockLine_RAM         (1UL << 2)         /*!< AHB clock line to RAM            */
#define SYSCON_AHBClockLine_FLASHCTRL   (1UL << 3)         /*!< AHB clock line to Flash control  */
#define SYSCON_AHBClockLine_FLASH       (1UL << 4)         /*!< AHB clock line to Flash memory   */
#define SYSCON_AHBClockLine_I2C0        (1UL << 5)         /*!< AHB clock line to I2C0           */
#define SYSCON_AHBClockLine_GPIO        (1UL << 6)         /*!< AHB clock line to GPIO           */
#define SYSCON_AHBClockLine_CT16B0      (1UL << 7)         /*!< AHB clock line to 16B timer 0    */
#define SYSCON_AHBClockLine_CT16B1      (1UL << 8)         /*!< AHB clock line to 16B timer 1    */
#define SYSCON_AHBClockLine_CT32B0      (1UL << 9)         /*!< AHB clock line to 32B timer 0    */
#define SYSCON_AHBClockLine_CT32B1      (1UL << 10)        /*!< AHB clock line to 32B timer 1    */
#define SYSCON_AHBClockLine_SSP0        (1UL << 11)        /*!< AHB clock line to SSP0           */
#define SYSCON_AHBClockLine_UART0       (1UL << 12)        /*!< AHB clock line to UART0          */
#define SYSCON_AHBClockLine_ADC0        (1UL << 13)        /*!< AHB clock line to ADC0           */
#define SYSCON_AHBClockLine_WDT         (1UL << 15)        /*!< AHB clock line to watchdog timer */
#define SYSCON_AHBClockLine_IOCON       (1UL << 16)        /*!< AHB clock line to IO config      */
#define SYSCON_AHBClockLine_SSP1        (1UL << 18)        /*!< AHB clock line to SSP1           */

#if defined(LPC11CXX)  /* CAN parts */
# define SYSCON_AHBClockLine_CAN0       (1UL << 17)        /*!< AHB clock line to CAN0           */
#endif

/** @} */

/** @defgroup SYSCON_SysPLLPVals System PLL "P" Values (divisor values)
  * @{
  */

/*! System PLL P (divisor) value settings -- divisor is 2 times the set PVal value */
typedef enum {
    SYSCON_SysPLLPVal_1 = 0x00,                            /*!< Divide by 2                      */
    SYSCON_SysPLLPVal_2 = 0x01,                            /*!< Divide by 4                      */
    SYSCON_SysPLLPVal_4 = 0x02,                            /*!< Divide by 8                      */
    SYSCON_SysPLLPVal_8 = 0x03                             /*!< Divide by 16                     */
} SYSCON_SysPLLPVal_Type;

/*! Macro to test whether parameter is a valid system oscillator frequency range value */
#define SYSCON_IS_SYSPLL_PVAL_TYPE(PVal) (((PVal) == SYSCON_SysPLLPVal_1) \
                                       || ((PVal) == SYSCON_SysPLLPVal_2) \
                                       || ((PVal) == SYSCON_SysPLLPVal_4) \
                                       || ((PVal) == SYSCON_SysPLLPVal_8))

/** @} */

/** @defgroup SYSCON_SysPLLClockSources System PLL Clock Source Values
  * @{
  */

/*! System PLL clock sources */
typedef enum {
    SYSCON_SysPLLClockSource_IRC = 0x00,                   /*!< PLL source: internal RC osc.     */
    SYSCON_SysPLLClockSource_SysOsc                        /*!< PLL source: system oscillator    */
} SYSCON_SysPLLClockSource_Type;

/*! Macro to test whether parameter is a valid PLL clock source value */
#define SYSCON_IS_SYSPLL_CLOCK_SOURCE(Source) (((Source) == SYSCON_SysPLLClockSource_IRC) \
                                            || ((Source) == SYSCON_SysPLLClockSource_SYSOsc))

/** @} */

/** @defgroup SYSCON_MainClockSources System Main (CPU) Clock Source Values
  * @{
  */

/*! Main CPU Clock Sources */
typedef enum {
    SYSCON_MainClockSource_IRC = 0x00,                     /*!< Main clock source: IRC osc       */
    SYSCON_MainClockSource_SysPLLIn,                       /*!< Main clock source: Sys PLL in    */
    SYSCON_MainClockSource_WDTOsc,                         /*!< Main clock source: WDT osc       */
    SYSCON_MainClockSource_SysPLLOut                       /*!< Main clock source: Sys PLL out   */
} SYSCON_MainClockSource_Type;

/*! Macro to test whether parameter is a valid main clock source value */
#define SYSCON_IS_MAIN_CLOCK_SOURCE(Source) (((Source) == SYSCON_MainClockSource_IRC) \
                                     || ((Source) == SYSCON_MainClockSource_SysPLLIn) \
                                     || ((Source) == SYSCON_MainClockSource_WDTOsc)   \
                                     || ((Source) == SYSCON_MainClockSource_SysPLLOut))

/** @} */

