tymmothy/LPC11xx_Device_Lib_v1.2/inc/lpc11xx/syscon.h
/** @defgroup SYSCON_WDTClockSources Watchdog Clock Source Values
  * @{
  */

/*! Watchdog timer clock sources */
typedef enum {
    SYSCON_WDTClockSource_IRC = 0x00,                      /*!< WDT clock source: IRC oscillator */
    SYSCON_WDTClockSource_MainClock,                       /*!< WDT clock source: Main clock     */
    SYSCON_WDTClockSource_WDTOsc                           /*!< WDT clock source: WDT oscillator */
} SYSCON_WDTClockSource_Type;

/*! Macro to test whether parameter is a valid Watchdog Timer Clock Source value */
#define SYSCON_IS_WDTCLK_SOURCE(Source) (((Source) == SYSCON_WDTClockSource_IRC)       \
                                      || ((Source) == SYSCON_WDTClockSource_MainClock) \
                                      || ((Source) == WDTCLK_Source_WDTOsc))

/** @} */

/** @defgroup SYSCON_CLKOUTSources CLKOUT (clock output pin) Clock Source Values
  * @{
  */

/*! CLKOUT clock sources */
typedef enum {
    SYSCON_CLKOUTSource_IRC = 0x00,                        /*!< CLKOUT Clock source: IRC osc     */
    SYSCON_CLKOUTSource_SYSOsc,                            /*!< CLKOUT clock source: System osc. */
    SYSCON_CLKOUTSource_WDTOsc,                            /*!< CLKOUT clock source: WDT osc     */
    SYSCON_CLKOUTSource_MainClock                          /*!< CLKOUT clock source: Main clock  */
} SYSCON_CLKOUTSource_Type;

/*! Macro to test whether parameter is a valid CLKOUT clock source value */
#define SYSCON_IS_CLKOUT_SOURCE(Source) (((Source) == SYSCON_CLKOUTSource_IRC)       \
                                       || ((Source) == SYSCON_CLKOUTSource_SYSOsc)   \
                                       || ((Source) == SYSCON_CLKOUTSource_WDTOsc)   \
                                       || ((Source) == SYSCON_CLKOUTSource_MainClock))

/** @} */

/** @defgroup SYSCON_BODResetVoltages Brownout Detector Reset Voltage Levels
  * @{
  */

/*! Brownout detector reset voltage levels */
typedef enum {
    SYSCON_BODResetVoltage_1V46 = 0x00,                    /*!< BOD resets MCU at 1.46v          */
    SYSCON_BODResetVoltage_2V06,                           /*!< BOD resets MCU at 2.06v          */
    SYSCON_BODResetVoltage_2V35,                           /*!< BOD resets MCU at 2.35v          */
    SYSCON_BODResetVoltage_2V80,                           /*!< BOD resets MCU at 2.8v           */
} SYSCON_BODResetVoltage_Type;

/*! Macro to test whether parameter is a valid brownout detector reset voltage value */
#define SYSCON_IS_BOD_RESET_VOLTAGE(Voltage) (((Voltage) == SYSCON_BODResetVoltage_1V46) \
                                           || ((Voltage) == SYSCON_BODResetVoltage_2V06) \
                                           || ((Voltage) == SYSCON_BODResetVoltage_2V35) \
                                           || ((Voltage) == SYSCON_BODResetVoltage_2V80))

/** @} */

/** @defgroup SYSCON_BODInterruptVoltages Brownout Detector Interrupt Voltage Levels
  * @{
  */

/*! Brownout detector interrupt voltage levels */
typedef enum {
    SYSCON_BODInterruptVoltage_1V65 = 0x00,                /*!< BOD IRQ triggered at 1.65v       */
    SYSCON_BODInterruptVoltage_2V22 = 0x04,                /*!< BOD IRQ triggered at 2.22v       */
    SYSCON_BODInterruptVoltage_2V52 = 0x08,                /*!< BOD IRQ triggered at 2.52v       */
    SYSCON_BODInterruptVoltage_2V80 = 0x0c                 /*!< BOD IRQ triggered at 2.8v        */
} SYSCON_BODInterruptVoltage_Type;

/*! Macro to test whether parameter is a valid brownout detector interrupt voltage value */
#define SYSCON_IS_BOD_INTERRUPT_VOLTAGE(Voltage) (((Voltage) == SYSCON_BODInterruptVoltage_1V65) \
                                               || ((Voltage) == SYSCON_BODInterruptVoltage_2V22) \
                                               || ((Voltage) == SYSCON_BODInterruptVoltage_2V52) \
                                               || ((Voltage) == SYSCON_BODInterruptVoltage_2V80))

/** @} */

/** @defgroup SYSCON_StartLogicEdges Start Logic Edge Triggers
  * @{
  */

/*! Start Logic Trigger Edges */
typedef enum {
    SYSCON_StartLogicEdge_Falling = 0x00,                  /*!< Start logic trig on falling edge */
    SYSCON_StartLogicEdge_Rising                           /*!< Start logic trig on rising edge  */
} SYSCON_StartLogicEdge_Type;

/*! Macro to test whether parameter is a valid start logic edge value */
#define SYSCON_IS_START_LOGIC_EDGE(Edge) (((Edge) == SYSCON_StartLogicEdge_Falling) \
                                       || ((Edge) == SYSCON_StartLogicEdge_Rising))

/** @} */

/** @defgroup SYSCON_StartLogicInputs Start Logic Input Pins
  * @{
  */

#define SYSCON_StartLogicInput_PIO0_0  (1 << 0)            /*!< System start logic input PIO0_0  */
#define SYSCON_StartLogicInput_PIO0_1  (1 << 1)            /*!< System start logic input PIO0_1  */
#define SYSCON_StartLogicInput_PIO0_2  (1 << 2)            /*!< System start logic input PIO0_2  */
#define SYSCON_StartLogicInput_PIO0_3  (1 << 3)            /*!< System start logic input PIO0_3  */
#define SYSCON_StartLogicInput_PIO0_4  (1 << 4)            /*!< System start logic input PIO0_4  */
#define SYSCON_StartLogicInput_PIO0_5  (1 << 5)            /*!< System start logic input PIO0_5  */
#define SYSCON_StartLogicInput_PIO0_6  (1 << 6)            /*!< System start logic input PIO0_6  */
#define SYSCON_StartLogicInput_PIO0_7  (1 << 7)            /*!< System start logic input PIO0_7  */
#define SYSCON_StartLogicInput_PIO0_8  (1 << 8)            /*!< System start logic input PIO0_8  */
#define SYSCON_StartLogicInput_PIO0_9  (1 << 9)            /*!< System start logic input PIO0_9  */
#define SYSCON_StartLogicInput_PIO0_10 (1 << 10)           /*!< System start logic input PIO0_10 */
#define SYSCON_StartLogicInput_PIO0_11 (1 << 11)           /*!< System start logic input PIO0_11 */
#define SYSCON_StartLogicInput_PIO1_0  (1 << 12)           /*!< System start logic input PIO1_0  */

/*! Type for passing start logic input masks */
typedef uint16_t SYSCON_StartLogicInputs_Type;

/** @} */

/** @defgroup SYSCON_PowerLines System Analog Power Line Control Bits
  * @{
  */


