tymmothy/LPC11xx_Device_Lib_v1.2/inc/lpc11xx/syscon.h
#define SYSCON_AnalogPowerLine_IRCOut  (1 << 0)            /*!< Power for IRC osc output         */
#define SYSCON_AnalogPowerLine_IRC     (1 << 1)            /*!< Power for internal RC osc        */
#define SYSCON_AnalogPowerLine_FLASH   (1 << 2)            /*!< Power for FLASH                  */
#define SYSCON_AnalogPowerLine_BOD     (1 << 3)            /*!< Power for brownout detector      */
#define SYSCON_AnalogPowerLine_ADC0    (1 << 4)            /*!< Power for ADC 0                  */
#define SYSCON_AnalogPowerLine_SysOsc  (1 << 5)            /*!< Power for system oscillator      */
#define SYSCON_AnalogPowerLine_WDTOsc  (1 << 6)            /*!< Power for WDT oscillator         */
#define SYSCON_AnalogPowerLine_SysPLL  (1 << 7)            /*!< Power for system PLL             */

/*! Type for passing analog power line control bits */
typedef uint16_t SYSCON_AnalogPowerLines_Type;

/** @} */

/** @defgroup SYSCON_PowerModes System Power Modes
  * @{
  */

/*! System Power Modes */
typedef enum {
    SYSCON_PowerMode_Sleep,            /*!< Sleep mode                       */
    SYSCON_PowerMode_Awake,            /*!< Awake from sleep mode            */
    SYSCON_PowerMode_Run,              /*!< Run mode                         */
} SYSCON_PowerMode_Type;

/*! Macro to test whether parameter is a valid system power mode value */
#define SYSCON_IS_POWER_MODE(Mode)  (((Mode) == SYSCON_PowerMode_Sleep) \
                                  || ((Mode) == SYSCON_PowerMode_Awake) \
                                  || ((Mode) == SYSCON_PowerMode_Run))

/** @} */

/** @defgroup LPC11xx_DeviceIDs LPC11xx Device ID Values
  * @{
  */

#define DeviceID_LPC1111_101           (0x041e502bUL)         /*!< LPC1111  w/8K  FLASH / 2K RAM */
#define DeviceID_LPC1111_102           (0x2516d02bUL)         /*!< LPC1111L w/8K  FLASH / 2K RAM */
#define DeviceID_LPC1111_201           (0x0416502bUL)         /*!< LPC1111  w/8K  FLASH / 4K RAM */
#define DeviceID_LPC1111_202           (0x2516902bUL)         /*!< LPC1111L w/8K  FLASH / 4K RAM */
#define DeviceID_LPC1112_101           (0x042d502bUL)         /*!< LPC1112  w/16K FLASH / 2K RAM */
#define DeviceID_LPC1112_102           (0x2524d02bUL)         /*!< LPC1112L w/16K FLASH / 2K RAM */
#define DeviceID_LPC1112_201           (0x0425502bUL)         /*!< LPC1112  w/16K FLASH / 4K RAM */
#define DeviceID_LPC1112_202           (0x2524902bUL)         /*!< LPC1112L w/16K FLASH / 2K RAM */
#define DeviceID_LPC1113_201           (0x0434502bUL)         /*!< LPC1113  w/24K FLASH / 4K RAM */
#define DeviceID_LPC1113_202           (0x2532902bUL)         /*!< LPC1113L w/24K FLASH / 4K RAM */
#define DeviceID_LPC1113_301           (0x0434102bUL)         /*!< LPC1113  w/24K FLASH / 8K RAM */
#define DeviceID_LPC1113_302           (0x2532102bUL)         /*!< LPC1113L w/24K FLASH / 4K RAM */
#define DeviceID_LPC1114_201           (0x0444502bUL)         /*!< LPC1114  w/32K FLASH / 4K RAM */
#define DeviceID_LPC1114_202           (0x2540902bUL)         /*!< LPC1114L w/32K FLASH / 4K RAM */
#define DeviceID_LPC1114_301           (0x0444102bUL)         /*!< LPC1114  w/32K FLASH / 8K RAM */
#define DeviceID_LPC1114_302           (0x2540102bUL)         /*!< LPC1114L w/32K FLASH / 8K RAM */
#define DeviceID_LPC11C12_301          (0x1421102bUL)         /*!< LPC11C12 w/16K FLASH / 8K RAM */
#define DeviceID_LPC11C14_301          (0x1440102bUL)         /*!< LPC11C14 w/32K FLASH / 8K RAM */
#define DeviceID_LPC11C22_301          (0x1431102bUL)         /*!< LPC11C22 w/16K FLASH / 8K RAM */
#define DeviceID_LPC11C24_301          (0x1430102bUL)         /*!< LPC11C24 w/32K FLASH / 8K RAM */

/** @} */

/**
  * @}
  */


/* Inline Functions ---------------------------------------------------------*/

/**
  * @defgroup SYSCON_Inline_Functions SYSCON Access-level Inline Functions
  * @{
  */

/** @brief  Remap the ISR vector area of memory to the specified region
  * @param  RemapMem  The area to map to the ISR vector area
  * @return None.
  *
  * This is used to change memory area where the interrupt vectors are found.
  */
__INLINE static void SYSCON_SetMemRemap(SYSCON_RemapMem_Type RemapMem)
{
    lpclib_assert(SYSCON_IS_REMAP_MEM(RemapMem));

    SYSCON->SYSMEMREMAP = RemapMem;
}

/** @brief  Return the area of memory currently remapped to the ISR Vector Memory Region
  * @return The currently remapped region
  */
__INLINE static SYSCON_RemapMem_Type SYSCON_GetMemRemap(void)
{
    return SYSCON->SYSMEMREMAP;
}

/** @brief  Assert the reset lines of specified peripherals.
  * @param  PeripheralResets  Mask of the peripherals to assert reset on
  * @return None.
  */
__INLINE static void SYSCON_AssertPeripheralResets(unsigned int PeripheralResets)
{
    lpclib_assert((PeripheralResets & ~SYSCON_PRESETCTRL_RESET_Mask) == 0);

    /* Note: Reset lines are active low */
    SYSCON->PRESETCTRL &= ~PeripheralResets;
}

/** @brief  De-assert the reset lines of specified peripherals.
  * @param  PeripheralResets  Mask of the peripherals to de-assert reset on
  * @return None.
  */
__INLINE static void SYSCON_DeassertPeripheralResets(unsigned int PeripheralResets)
{
    lpclib_assert((PeripheralResets & ~SYSCON_PRESETCTRL_RESET_Mask) == 0);

    /* Note: Reset lines are active low */
    SYSCON->PRESETCTRL |= PeripheralResets;
}

/** @brief  Get the mask specifying peripherals currently held in reset.
  * @return A mask of the peripherals being held in reset.
  */
__INLINE static unsigned int SYSCON_GetAssertedPeripheralResets(void)
{
    return (~(SYSCON->PRESETCTRL)) & SYSCON_PRESETCTRL_RESET_Mask;
}

/** @brief  Test whether the system PLL is locked.
  * @return 1 if the System PLL is locked, 0 otherwise.
  */
__INLINE static unsigned int SYSCON_SysPLLIsLocked(void)
{
    return (SYSCON->SYSPLLSTAT & SYSCON_SYSPLLSTAT_LOCKED) ? 1:0;
}

/** @brief  Enable bypass of the system oscillator.
  * @return None.
  */
__INLINE static void SYSCON_EnableSysOscBypass(void)
{
    SYSCON->SYSOSCCTRL |= SYSCON_SYSOSCCTRL_BYPASS;
}

/** @brief  Disable bypass of the system oscillator.
  * @return None.
  */
__INLINE static void SYSCON_DisableSysOscBypass(void)
{
    SYSCON->SYSOSCCTRL &= ~SYSCON_SYSOSCCTRL_BYPASS;
}

/** @brief  Test whether the system oscillator is currently bypassed.
  * @return 1 if the system oscillator is bypassed, 0 otherwise.
  */
__INLINE static unsigned int SYSCON_SysOscBypassIsEnabled(void)
{
    return (SYSCON->SYSOSCCTRL & SYSCON_SYSOSCCTRL_BYPASS) ? 1:0;
}

