tymmothy/LPC11xx_Device_Lib_v1.2/inc/lpc11xx/syscon.h
/** @brief  Set the frequency range of the xtal feeding the system oscillator.
  * @param  Range    Value specifying the frequency range of the xtal.
  * @return None.
  */
__INLINE static void SYSCON_SetSysOscFreqRange(SYSCON_SysOscFreqRange_Type Range)
{
    lpclib_assert(SYSCON_IS_SYSOSC_FREQ_RANGE(Range));

    SYSCON->SYSOSCCTRL = (SYSCON->SYSOSCCTRL & ~SYSCON_SYSOSCCTRL_FREQRANGE) | Range;
}

/** @brief  Get the set frequency range of the xtal feeding the system oscillator.
  * @return A value specifying the frequency range of the xtal.
  */
__INLINE static SYSCON_SysOscFreqRange_Type SYSCON_GetSysOscFreqRange(void)
{
    return SYSCON->SYSOSCCTRL & SYSCON_SYSOSCCTRL_FREQRANGE;
}

/** @brief  Set the divider of the watchdog timer's oscillator
  * @param  Divider   The value by which to divide the WDT clock
  * @return None.
  *
  * Divider must be an even # between 2 and 64 inclusive.
  */
__INLINE static void SYSCON_SetWDTOscDivider(unsigned int Divider)
{
    lpclib_assert((Divider <= 64) && (Divider != 0));
    lpclib_assert((Divider & 1) == 0);

    SYSCON->WDTOSCCTRL = (SYSCON->WDTOSCCTRL & ~SYSCON_WDTOSCCTRL_DIV_Mask)
                          | ((Divider >> 1) - 1);
}

/** @brief  Get the current divider of the watchdog timer's oscillator.
  * @return The current divider value (# between 2 & 64 inclusive)
  */
__INLINE static unsigned int SYSCON_GetWDTOscDivider(void)
{
    lpclib_assert(SYSCON_IS_WDT_OSC_FREQ(OscFreq));

    return ((SYSCON->WDTOSCCTRL & SYSCON_WDTOSCCTRL_DIV_Mask) + 1) << 1;
}

/** @brief  Set the frequency of the watchdog timer's oscillator.
  * @param  OscFreq  The WDT oscillator frequency setting (of WDT_OscFreq_Type)
  * @return None.
  */
__INLINE static void SYSCON_SetWDTOscFreq(SYSCON_WDTOscFreq_Type OscFreq)
{
    lpclib_assert(SYSCON_IS_WDT_OSC_FREQ(OscFreq));

    SYSCON->WDTOSCCTRL = (SYSCON->WDTOSCCTRL & ~SYSCON_WDTOSCCTRL_FREQSEL_Mask)
                         | (OscFreq << SYSCON_WDTOSCCTRL_FREQSEL_Shift);
}

/** @brief  Get the current frequency setting of the watchdog timer oscillator.
  * @return The currently configured WDT oscillator frequency setting.
  */
__INLINE static SYSCON_WDTOscFreq_Type SYSCON_GetWDTOscFreq(void)
{
    return (SYSCON_WDTOscFreq_Type)((SYSCON->WDTOSCCTRL & SYSCON_WDTOSCCTRL_FREQSEL_Mask)
            >> SYSCON_WDTOSCCTRL_FREQSEL_Shift);
}

/** @brief  Set the internal RC oscillator's trim value.
  * @param  Trim Value to set (0 - 255)
  * @return None.
  *
  * Not normally necessary to be adjusted; set by system boot ROM.
  */
__INLINE static void SYSCON_SetIRCTrim(unsigned int Trim)
{
    lpclib_assert((Trim & ~IRCCTL_TRIM_Mask) == 0);

    SYSCON->IRCCTRL = Trim;
}

/** @brief  Get the configured internal RC oscillator's trim value (0 - 255).
  * @return The configured IRC trim value.
  */
__INLINE static unsigned int SYSCON_GetIRCTrim(void)
{
    return SYSCON->IRCCTRL;
}

/** @brief  Get the source(s) that triggered the previous system reset(s).
  * @return A bitmask of the reset sources.
  *
  * Sources are sticky & must be cleared by the application.
  */
__INLINE static uint32_t SYSCON_GetResetSources(void)
{
    return SYSCON->SYSRESSTAT;
}

/** @brief  Clear reset trigger sources.
  * @param  sources  A bitmask of reset sources to clear
  * @return None.
  */
__INLINE static void SYSCON_ClearResetSource(uint32_t sources)
{
    lpclib_assert((sources & ~SYSCON_SYSRESSTAT_STAT_Mask) == 0);

    SYSCON->SYSRESSTAT = sources;
}

/** @brief  Set the system PLL's clock source.
  * @param  Source   The new clock source
  * @return None.
  *
  * Need to call SYSPLL_EnableSourceUpdate after setting, and wait for
  *  the source to be updated (SYSPLL_SourceIsUpdated() == 1)
  */
__INLINE static void SYSCON_SetSysPLLClockSource(SYSCON_SysPLLClockSource_Type Source)
{
    lpclib_assert(IS_SYSPLL_CLOCK_SOURCE(Source));

    SYSCON->SYSPLLCLKSEL = Source;
}

/** @brief  Get the system PLL's current clock source.
  * @return The current clock source.
  */
__INLINE static SYSCON_SysPLLClockSource_Type SYSCON_GetSysPLLClockSource(void)
{
    return SYSCON->SYSPLLCLKSEL;
}

/** @brief  Enable updating of the system PLL's clock source.
  * @return None.
  *
  * Used after changing the system PLL clock source to make the change active.
  */
__INLINE static void SYSCON_EnableSysPLLClockSourceUpdate(void)
{
    SYSCON->SYSPLLCLKUEN = SYSCON_SYSPLLUEN_ENA;
    SYSCON->SYSPLLCLKUEN = 0;
    SYSCON->SYSPLLCLKUEN = SYSCON_SYSPLLUEN_ENA;
}

/** @brief  Test whether the system PLL's clock source has successfully updated.
  * @return 1 if the source has updated, 0 otherwise.
  *
  * Generally will be called in a while() loop after the source has been updated
  * and SYSPLL_EnableSourceUpdate() has been called.
  */
__INLINE static unsigned int SYSCON_SysPLLClockSourceIsUpdated(void)
{
    return (((uint16_t)(SYSCON->SYSPLLCLKUEN)) & ((uint16_t)SYSCON_SYSPLLUEN_ENA)) ? 1:0;
}

/** @brief  Set the system PLL's clock scaler setting.
  * @param  Scaler  The new clock scaler setting
  * @return None.
  *
  * The scaler value is a hybrid of PLL M (multiplier) and P (divider)
  * values.
  */
__INLINE static void SYSCON_SetSysPLLClockScaler(unsigned int Scaler)
{
    lpclib_assert((Scaler & ~(SYSPLLCTRL_MSEL_Mask | SYSPLLCTRL_PSEL_Mask)) == 0);

    SYSCON->SYSPLLCTRL = Scaler;
}

/** @brief  Get the system PLL's current scaler (M and P) setting.
  * @return The system PLL's current scaler setting.
  *
  * The scaler value is a hybrid of PLL M (multiplier) and P (divider)
  * values.
  */
__INLINE static unsigned int SYSCON_GetSysPLLClockScaler(void)
{
    return (SYSCON->SYSPLLCTRL & (SYSCON_SYSPLLCTRL_MSEL_Mask | SYSCON_SYSPLLCTRL_PSEL_Mask));
}

/** @brief  Set the system PLL's M (multiplier) value
  * @param  MVal  The new PLL multiplier value
  * @return None.
  */
__INLINE static void SYSCON_SetSysPLLMVal(unsigned int MVal)
{
    lpclib_assert((MVal & ~(SYSPLLCTRL_MSEL_Mask)) == 0);

    SYSCON->SYSPLLCTRL = (SYSCON->SYSPLLCTRL & ~SYSCON_SYSPLLCTRL_MSEL_Mask) | MVal;
}

/** @brief  Get the system PLL's current M (multiplier) value.
  * @return The current system PLL M value
  */
__INLINE static uint8_t SYSCON_GetSysPLLMVal(void)
{
    return (SYSCON->SYSPLLCTRL & SYSCON_SYSPLLCTRL_MSEL_Mask);
}

/** @brief  Set the system PLL's P (divider) value.
  * @param  PVal  The new PLL divider value
  * @return None.
  */
__INLINE static void SYSCON_SetSysPLLPVal(unsigned int PVal)
{
    lpclib_assert(SYSCON_IS_SYSPLL_PVAL_TYPE(PVal));

    SYSCON->SYSPLLCTRL = (SYSCON->SYSPLLCTRL & ~SYSCON_SYSPLLCTRL_PSEL_Mask)
                          | (PVal << SYSCON_SYSPLLCTRL_PSEL_Shift);
}

/** @brief  Get the system PLL's current P (divider) value.
  * @return The current system PLL P value
  */
__INLINE static unsigned int SYSCON_GetSysPLLPVal(void)
{
    return (SYSCON->SYSPLLCTRL & SYSCON_SYSPLLCTRL_PSEL_Mask)
            >> SYSCON_SYSPLLCTRL_PSEL_Shift;
}

/** @brief  Set the main system clock source.
  * @param  Source  The new clock source.
  * @return None.
  *
  * Call MAINCLK_EnableSourceUpdate after setting, and wait for
  *  the source to be updated (MAINCLK_SourceIsUpdated() == 1)
  */
__INLINE static void SYSCON_SetMainClockSource(SYSCON_MainClockSource_Type Source)
{
    lpclib_assert(IS_MAINCLK_SOURCE(Source));

