tymmothy/LPC11xx_Device_Lib_v1.2/inc/lpc11xx/syscon.h
    SYSCON->MAINCLKSEL = Source;
}

/** @brief  Get the main clock's currently configured clock source.
  * @return The current clock source.
  */
__INLINE static SYSCON_MainClockSource_Type SYSCON_GetMainClockSource(void)
{
    return SYSCON->MAINCLKSEL;
}

/** @brief  Enable updating of the main system clock's source.
  * @return None.
  *
  * Used after changing the main system clock source to make the change active.
  */
__INLINE static void SYSCON_EnableMainClockSourceUpdate(void)
{
    SYSCON->MAINCLKUEN = SYSCON_MAINCLKUEN_ENA;
    SYSCON->MAINCLKUEN = 0;
    SYSCON->MAINCLKUEN = SYSCON_MAINCLKUEN_ENA;
}

/** @brief  Test whether the main system clock source has successfully updated.
  * @return 1 if the source has updated, 0 otherwise.
  *
  * Generally will be called in a while() loop after the source has been updated
  * and MAINCLK_EnableSourceUpdate() has been called.
  */
__INLINE static unsigned int SYSCON_MainClockSourceIsUpdated(void)
{
    return (SYSCON->MAINCLKUEN & SYSCON_MAINCLKUEN_ENA) ? 1:0;
}

/** @brief  Set the value by which the main clock will be divided to feed the AHB clock.
  * @param  Divider  The new AHB clock divider.
  * @return None.
  *
  * Divider must be an integer from 0-255 inclusive (0 == disabled)
  */
__INLINE static void SYSCON_SetAHBClockDivider(uint32_t Divider)
{
    lpclib_assert((Divider & ~SYSAHBCLKDIV_Mask) == 0);

    SYSCON->SYSAHBCLKDIV = Divider;
}

/** @brief  Get the value by which the main clock is divided to feed the AHB clock.
  * @return The current clock divider.
  */
__INLINE static uint32_t SYSCON_GetAHBClockDivider(void)
{
    return SYSCON->SYSAHBCLKDIV;
}

/** @brief  Enable the specified clock lines to devices on the AHB bus.
  * @param  Clocklines  A bitmask of clock lines to enable
  * @return None.
  */
__INLINE static void SYSCON_EnableAHBClockLines(uint32_t Clocklines)
{
    lpclib_assert((Clocklines & ~SYSCON_SYSAHBCLKCTRL_Mask) == 0);

    SYSCON->SYSAHBCLKCTRL |= Clocklines;
}

/** @brief  Disable the specified clock lines from devices on the AHB bus.
  * @param  Clocklines  A bitmask of clock lines to disable
  * @return None.
  */
__INLINE static void SYSCON_DisableAHBClockLines(uint32_t Clocklines)
{
    lpclib_assert((Clocklines & ~SYSCON_SYSAHBCLKCTRL_Mask) == 0);

    SYSCON->SYSAHBCLKCTRL &= ~Clocklines;
}

/** @brief  Get the currently enabled clock lines to devices on the AHB Bus.
  * @return A bitmask of the currently enabled AHB bus clock lines.
  */
__INLINE static uint32_t SYSCON_GetEnabledAHBClockLines(void)
{
    return SYSCON->SYSAHBCLKCTRL & SYSCON_SYSAHBCLKCTRL_Mask;
}

/** @brief  Set the value by which the main clock will be divided to feed the SSP0 clock.
  * @param  Divider  The new SSP0 clock divider.
  * @return None.
  *
  * Divider must be an integer from 0-255 inclusive (0 == disabled)
  */
__INLINE static void SYSCON_SetSSP0ClockDivider(unsigned int Divider)
{
    lpclib_assert((Divider & ~SYSCON_SSP0CLKDIV_Mask) == 0);

    SYSCON->SSP0CLKDIV = Divider;
}

/** @brief  Get the value by which the main clock is divided to feed the SSP0 clock.
  * @return The current SSP0 clock divider.
  */
__INLINE static unsigned int SYSCON_GetSSP0ClockDivider(void)
{
    return SYSCON->SSP0CLKDIV;
}

/** @brief  Set the value by which the main clock will be divided to feed the SSP1 clock.
  * @param  Divider  The new SSP1 clock divider.
  * @return None.
  *
  * Divider must be an integer from 0-255 inclusive (0 == disabled)
  */
__INLINE static void SYSCON_SetSSP1ClockDivider(unsigned int Divider)
{
    lpclib_assert((Divider & ~SYSCON_SSP1CLKDIV_Mask) == 0);

    SYSCON->SSP1CLKDIV = Divider;
}

/** @brief  Get the value by which the main clock is divided to feed the SSP1 clock.
  * @return The current SSP1 clock divider.
  */
__INLINE static unsigned int SYSCON_GetSSP1ClockDivider(void)
{
    return SYSCON->SSP1CLKDIV;
}

/** @brief  Set the value by which the main clock will be divided to feed the UART0 clock.
  * @param  Divider  The new UART0 clock divider.
  * @return None.
  *
  * Divider must be an integer from 0-255 inclusive (0 == disabled)
  */
__INLINE static void SYSCON_SetUART0ClockDivider(unsigned int Divider)
{
    lpclib_assert((Divider & ~SYSCON_UART0CLKDIV_Mask) == 0);

    SYSCON->UART0CLKDIV = Divider;
}

/** @brief  Get the value by which the main clock is divided to feed the UART0 clock.
  * @return The current UART0 clock divider.
  */
__INLINE static unsigned int SYSCON_GetUART0ClockDivider(void)
{
    return SYSCON->UART0CLKDIV;
}

/** @brief  Set the watchdog timer's clock source.
  * @param  Source   The new WDT clock source
  * @return None.
  *
  * Call WDTCLK_EnableSourceUpdate after setting, and wait for
  *  the source to be updated (WDTCLK_SourceIsUpdated() == 1)
  */
__INLINE static void SYSCON_SetWDTClockSource(SYSCON_WDTClockSource_Type Source)
{
    lpclib_assert(SYSCON_IS_WDT_CLOCK_SOURCE(Source));

    SYSCON->WDTCLKSEL = Source;
}

/** @brief  Get the current watchdog timer clock source.
  * @return The current WDT clock source.
  */
__INLINE static SYSCON_WDTClockSource_Type SYSCON_GetWDTClockSource(void)
{
    return SYSCON->WDTCLKSEL;
}

/** @brief  Enable updating of the watchdog timer's clock source.
  * @return None.
  *
  * Used after changing the watchdog timer's clock source to make the change active.
  */
__INLINE static void SYSCON_EnableWDTClockSourceUpdate(void)
{
    SYSCON->WDTCLKUEN = SYSCON_WDTCLKUEN_ENA;
    SYSCON->WDTCLKUEN = 0;
    SYSCON->WDTCLKUEN = SYSCON_WDTCLKUEN_ENA;
}

/** @brief  Test whether the watchdog timer's clock source has successfully updated.
  * @return 1 if the source has updated, 0 otherwise.
  *
  * Generally will be called in a while() loop after the source has been updated
  * and WDTCLK_EnableSourceUpdate() has been called.
  */
__INLINE static unsigned int SYSCON_WDTClockSourceIsUpdated(void)
{
    return (((uint16_t)SYSCON->WDTCLKUEN) & ((uint16_t)SYSCON_WDTCLKUEN_ENA)) ? 1:0;
}

/** @brief  Set the value by which the watchdog timer's clock input will be divided.
  * @param  Divider  The new clock divider.
  * @return None.
  *
  * Divider must be an integer from 0 to 255 inclusive (0 == WDT clock disabled).
  */
__INLINE static void SYSCON_SetWDTClockDivider(unsigned int Divider)
{
    lpclib_assert((Divider & ~SYSCON_WDTCLKDIV_Mask) == 0);

    SYSCON->WDTCLKDIV = Divider;
}

/** @brief  Get the watchdog timer's current clock divider.
  * @return The current WDT clock divider.
  */
__INLINE static unsigned int SYSCON_GetWDTClockDivider(void)
{
    return SYSCON->WDTCLKDIV;
}

/** @brief  Set the clock source for the CLKOUT pin.
  * @param  Source   The new CLKOUT clock source.
  * @return None.
  *
  * Call CLKOUT_EnableSourceUpdate after setting, and wait for
  *  the source to be updated (CLKOUT_SourceIsUpdated() == 1)
  */
__INLINE static void SYSCON_SetCLKOUTSource(SYSCON_CLKOUTSource_Type Source)
{
    lpclib_assert(SYSCON_IS_CLKOUT_SOURCE(Source));

    SYSCON->CLKOUTCLKSEL = Source;
}

