tymmothy/LPC11xx_Device_Lib_v1.2/inc/lpc11xx/syscon.h
/** @brief  Get the current CLKOUT clock source.
  * @return The current CLKOUT source.
  */
__INLINE static SYSCON_CLKOUTSource_Type SYSCON_GetCLKOUTSource(void)
{
    return SYSCON->CLKOUTCLKSEL;
}

/** @brief  Enable updating of CLKOUT's clock source.
  * @return None.
  *
  * Used after changing the CLKOUT clock source to make the change active.
  */
__INLINE static void SYSCON_EnableCLKOUTSourceUpdate(void)
{
    SYSCON->CLKOUTUEN = SYSCON_CLKOUTUEN_ENA;
    SYSCON->CLKOUTUEN = 0;
    SYSCON->CLKOUTUEN = SYSCON_CLKOUTUEN_ENA;
}

/** @brief  Test whether CLKOUT's clock source has successfully updated.
  * @return 1 if the source has updated, 0 otherwise.
  *
  * Generally will be called in a while() loop after the source has been updated
  * and CLKOUT_EnableSourceUpdate() has been called.
  */
__INLINE static unsigned int SYSCON_CLKOUTSourceIsUpdated(void)
{
    return (SYSCON->CLKOUTUEN & SYSCON_CLKOUTUEN_ENA) ? 1:0;
}

/** @brief  Set the value by which CLKOUT's input clock will be divided.
  * @param  Divider  The new clock divider.
  * @return None.
  *
  * Divider must be an integer from 0 to 255 inclusive (0 == CLKOUT clock disabled).
  */
__INLINE static void SYSCON_SetCLKOUTDivider(unsigned int Divider)
{
    lpclib_assert((Divider & ~SYSCON_CLKOUTDIV_Mask) == 0);

    SYSCON->CLKOUTDIV = Divider;
}

/** @brief  Get CLKOUT's current clock divider.
  * @return The current CLKOUT input clock divider.
  */
__INLINE static unsigned int SYSCON_GetCLKOUTDivider(void)
{
    return SYSCON->CLKOUTDIV;
}

/** @brief  Set the brownout detector's reset trigger voltage.
  * @param  Voltage   The new reset trigger voltage
  * @return None.
  */
__INLINE static void SYSCON_SetBODResetVoltage(SYSCON_BODResetVoltage_Type Voltage)
{
    lpclib_assert(SYSCON_IS_BOD_RESET_VOLTAGE(Voltage));

    SYSCON->BODCTRL = (SYSCON->BODCTRL & ~SYSCON_BODCTRL_BODRSTLEV_Mask) | Voltage;
}

/** @brief  Get the brownout detector's current reset trigger voltage.
  * @return The current reset trigger voltage.
  */
__INLINE static SYSCON_BODResetVoltage_Type SYSCON_GetBODResetVoltage(void)
{
    return SYSCON->BODCTRL & SYSCON_BODCTRL_BODRSTLEV_Mask;
}

/** @brief  Set the brownout detector's interrupt trigger voltage
  * @param  Voltage   The new interrupt trigger voltage
  * @return None.
  */
__INLINE static void SYSCON_SetBODInterruptVoltage(SYSCON_BODInterruptVoltage_Type Voltage)
{
    lpclib_assert(SYSCON_IS_BOD_INTERRUPT_VOLTAGE(Voltage));

    SYSCON->BODCTRL = (SYSCON->BODCTRL & ~SYSCON_BODCTRL_BODINTVAL_Mask) | Voltage;
}

/** @brief  Get the brownout detector's current interrupt trigger voltage.
  * @return The current interrupt trigger voltage.
  */
__INLINE static SYSCON_BODInterruptVoltage_Type SYSCON_GetBODInterruptVoltage(void)
{
    return SYSCON->BODCTRL & SYSCON_BODCTRL_BODINTVAL_Mask;
}

/** @brief  Enable resetting of the chip by the brownout detector.
  * @return None.
  */
__INLINE static void SYSCON_EnableBODChipReset(void)
{
    SYSCON->BODCTRL |= SYSCON_BODCTRL_BODRSTENA;
}

/** @brief  Disable resetting of the chip by the brownout detector.
  * @return None.
  */
__INLINE static void SYSCON_DisableBODChipReset(void)
{
    SYSCON->BODCTRL |= SYSCON_BODCTRL_BODRSTENA;
}

/** @brief  Test whether the brownout detector is configured to reset the chip on low voltage.
  * @return 1 if BOD chip reset is enabled, 0 otherwise.
  */
__INLINE static unsigned int SYSCON_BODChipResetIsEnabled(void)
{
    return (SYSCON->BODCTRL & SYSCON_BODCTRL_BODRSTENA) ? 1:0;
}

/** @brief  Set the SysTick calibration value.
  * @param  Calibration  The new SysTick calibration value (0-4095)
  * @return None.
  */
__INLINE static void SYSCON_SetSysTickCalibration(uint16_t Calibration)
{
    lpclib_assert((Calibration & ~SYSCON_SYSTCKCAL_Mask) == 0);

    SYSCON->SYSTCKCAL = Calibration;
}

/** @brief  Get the current SysTick calibration value.
  * @return The current SysTick calibration value (0-4095).
  */
__INLINE static uint16_t SYSCON_GetSysTickCalibration(void)
{
    return SYSCON->SYSTCKCAL;
}

/** @brief  Set the start logic edges for the specified inputs.
  * @param  Inputs      A bitmask of start logic inputs
  * @param  Edge        The edge setting on which to trigger start logic on those inputs
  * @return None.
  */
__INLINE static void SYSCON_SetStartLogicEdges(SYSCON_StartLogicInputs_Type Inputs,
                                               SYSCON_StartLogicEdge_Type Edge)
{
    lpclib_assert((Inputs & ~SYSCON_STARTAPRP0_Mask) == 0);
    lpclib_assert(SYSCON_IS_START_LOGIC_EDGE(Edge));

    if (Edge == SYSCON_StartLogicEdge_Falling) {
        SYSCON->STARTAPRP0 &= ~Inputs;
    } else {
        SYSCON->STARTAPRP0 |= Inputs;
    }
}

/** @brief  Get the start logic inputs configured to trigger on the given edge.
  * @return A bitmask of start logic inputs configured to trigger on the given edge type.
  */
__INLINE static SYSCON_StartLogicInputs_Type SYSCON_GetStartLogicInputsWithEdge(SYSCON_StartLogicEdge_Type Edge)
{
     lpclib_assert(SYSCON_IS_START_LOGIC_EDGE(Edge));

    if (Edge == SYSCON_StartLogicEdge_Falling) {
        return (~SYSCON->STARTAPRP0) & SYSCON_STARTAPRP0_Mask;
    } else {
        return SYSCON->STARTAPRP0;
    }
}

/** @brief  Enable start logic for the specified inputs.
  * @param  Inputs      A bitmask of start logic inputs.
  * @return None.
  */
__INLINE static void SYSCON_EnableStartLogicInputs(SYSCON_StartLogicInputs_Type Inputs)
{
    lpclib_assert((Inputs & ~SYSCON_STARTEPRP0_Mask) == 0);

    SYSCON->STARTERP0 |= Inputs;
}

/** @brief  Disable start logic for the specified inputs.
  * @param  Inputs      A bitmask of start logic inputs.
  * @return None.
  */
__INLINE static void SYSCON_DisableStartLogicInputs(SYSCON_StartLogicInputs_Type Inputs)
{
    lpclib_assert((Inputs & ~SYSCON_STARTEPRP0_Mask) == 0);

    SYSCON->STARTERP0 &= ~Inputs;
}

/** @brief  Get the currently enabled start logic inputs.
  * @return A bitmask of start logic inputs for which start logic is enabled.
  */
__INLINE static SYSCON_StartLogicInputs_Type SYSCON_GetEnabledStartLogicInputs(void)
{
    return SYSCON->STARTERP0;
}

/** @brief  Reset the specified start logic inputs.
  * @param  Inputs   A bitmask of start logic inputs to reset
  * @return None.
  *
  * Start logic inputs need to be reset each time they are used to re-enable
  * triggering.
  */
__INLINE static void SYSCON_ResetStartLogicInputs(SYSCON_StartLogicInputs_Type Inputs)
{
    lpclib_assert((Inputs & ~SYSCON_STARTRSRP0CLR_Mask) == 0);

    SYSCON->STARTRSRP0CLR |= Inputs;
}

