tymmothy/LPC11xx_Device_Lib_v1.2/inc/lpc11xx/syscon.h
/** @brief  Get the triggered states for all start logic inputs.
  * @return A bitmask of inputs for which start logic has been triggered.
  *
  * Start logic inputs need to be reset each time they are used to re-enable
  * triggering.
  */
__INLINE static SYSCON_StartLogicInputs_Type SYSCON_GetTriggeredStartLogicInputs(void)
{
    return SYSCON->STARTSRP0;
}

/** @brief  Initialize the system's analog power configuration
  * @return None.
  *
  * Sets reserved bits to required values.  Clears sleep config.
  */
__INLINE static void SYSCON_InitAnalogPowerLines(void)
{
    SYSCON->PDSLEEPCFG = SYSCON_PDSLEEPCFG_Required;
    SYSCON->PDAWAKECFG = (SYSCON->PDAWAKECFG & 0xff) | SYSCON_PDAWAKECFG_Required;
    SYSCON->PDRUNCFG = (SYSCON->PDRUNCFG & 0xff) | SYSCON_PDRUNCFG_Required;
}

/** @brief  Enable power to analog power blocks for the specified power mode.
  * @param  PowerMode  The power mode in which this setting should apply
  * @param  PowerLines The blocks to which power should be enabled
  * @return None.
  *
  * Valid PowerModes:
  * - SYSCON_PowerMode_Sleep
  * - SYSCON_PowerMode_Awake
  * - SYSCON_PowerMode_Run
  */
__INLINE static void SYSCON_EnableAnalogPowerLines(SYSCON_PowerMode_Type PowerMode,
                                                   SYSCON_AnalogPowerLines_Type PowerLines)
{
    lpclib_assert((PowerLines & ~SYSCON_AnalogPowerLines_Mask) == 0);
    lpclib_assert(SYSCON_IS_POWER_MODE(PowerMode));

    if (PowerMode == SYSCON_PowerMode_Sleep) {
        SYSCON->PDSLEEPCFG = (SYSCON->PDSLEEPCFG & ~(PowerLines)) | SYSCON_PDSLEEPCFG_Required;
    } else if (PowerMode == SYSCON_PowerMode_Awake) {
        SYSCON->PDAWAKECFG = (SYSCON->PDAWAKECFG & ~(PowerLines)) | SYSCON_PDAWAKECFG_Required;
    } else { /* SYSCON_PowerMode_Run */
        SYSCON->PDRUNCFG = (SYSCON->PDRUNCFG & ~((uint16_t)PowerLines)) | SYSCON_PDRUNCFG_Required;
    }
}

/** @brief  Disable power to analog power blocks for the specified power mode.
  * @param  PowerMode  The power mode in which this setting should apply
  * @param  PowerLines The analog blocks to which power should be disabled
  * @return None.
  *
  * Valid PowerModes:
  * - SYSCON_PowerMode_Sleep
  * - SYSCON_PowerMode_Awake
  * - SYSCON_PowerMode_Run
  */
__INLINE static void SYSCON_DisableAnalogPowerLines(SYSCON_PowerMode_Type PowerMode,
                                                    SYSCON_AnalogPowerLines_Type PowerLines)
{
    lpclib_assert((PowerLines & ~SYSCON_AnalogPowerLines_Mask) == 0);
    lpclib_assert(SYSCON_IS_POWER_MODE(PowerMode));

    if (PowerMode == SYSCON_PowerMode_Sleep) {
        PowerLines &= ~(SYSCON_AnalogPowerLine_BOD | SYSCON_AnalogPowerLine_WDTOsc);
        SYSCON->PDSLEEPCFG |= (SYSCON_PDSLEEPCFG_Required | PowerLines);
    } else if (PowerMode == SYSCON_PowerMode_Awake) {
        SYSCON->PDAWAKECFG |= (SYSCON_PDAWAKECFG_Required | PowerLines);
    } else { /* SYSCON_PowerMode_Run */
        SYSCON->PDRUNCFG |= (SYSCON_PDRUNCFG_Required | PowerLines);
    }
}

/** @brief  Get Enabled Power Settings for System Analog Power Blocks
  * @param  PowerMode  The power mode to get the power settings for
  * @return Bits specifying powered analog peripherals in given mode
  */
__INLINE static SYSCON_AnalogPowerLines_Type SYSCON_GetEnabledAnalogPowerLines(SYSCON_PowerMode_Type PowerMode)
{
    if (PowerMode == SYSCON_PowerMode_Sleep) {
        return ~(SYSCON->PDSLEEPCFG & SYSCON_PDSLEEPCFG_Mask);
    } else if (PowerMode == SYSCON_PowerMode_Awake) {
        return ~(SYSCON->PDAWAKECFG & SYSCON_PDAWAKECFG_Mask);
    } else { /* SYSCON_PowerMode_Run */
        return ~(SYSCON->PDRUNCFG & SYSCON_PDRUNCFG_Mask);
    }
}

/** @brief  Get the MCU's Device ID
  * @return The device's ID.
  */
__INLINE static uint32_t SYSCON_GetDeviceID(void)
{
    return SYSCON->DEVICE_ID;
}

/**
  * @}
  */

/**
  * @}
  */


#ifdef __cplusplus
};
#endif

#endif /* #ifndef LPC_SYSCON_H_ */

